# Parameter Type Id Array Number Property

Source: https://www.revitapidocs.com/2026/df8ce840-c067-2463-ec00-25814f506fc7.htm

---

| Parameter Type Id Array Number Property |
| --- |

"Number"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId ArrayNumber { get; }
```

```
Public Shared ReadOnly Property ArrayNumber As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ ArrayNumber {
	ForgeTypeId^ get ();
}
```

```
static member ArrayNumber : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace